# DataFrame

In [15]:
import pandas as pd

In [16]:
df1 = pd.DataFrame()

In [17]:
type(df1)

pandas.core.frame.DataFrame

In [18]:
print(df1)

Empty DataFrame
Columns: []
Index: []

In [19]:
# returning the columns of the dataframe
df1.columns

RangeIndex(start=0, stop=0, step=1)

In [20]:
print(df1.index)

RangeIndex(start=0, stop=0, step=1)

In [26]:
students_list = [['Bob', 'Williams', 26, 'Computer Engineering', 86],
                 ['Emma', 'Johnson', 23, 'Math', 92],
                 ['Sarah', 'Smith', 22, 'Chemistry', 95],
                 ['Alex', 'Brown',21, 'Electrical engineering', 82],
                ]

In [27]:
students_df = pd.DataFrame(students_list)

In [28]:
students_df

       0         1   2                       3   4
0    Bob  Williams  26    Computer Engineering  86
1   Emma   Johnson  23                    Math  92
2  Sarah     Smith  22               Chemistry  95
3   Alex     Brown  21  Electrical engineering  82

In [29]:
# Giving the columns headings
students_df = pd.DataFrame(students_list, columns = ["FirstName", "LastName", "Age", "Major", "Score"])

In [30]:
students_df

  FirstName  LastName  Age                   Major  Score
0       Bob  Williams   26    Computer Engineering     86
1      Emma   Johnson   23                    Math     92
2     Sarah     Smith   22               Chemistry     95
3      Alex     Brown   21  Electrical engineering     82

In [32]:
# Changing the index to have the email of the students
students_df = pd.DataFrame(students_list, columns = ["FirstName", "LastName", "Age", "Major", "Score"],
                          index = ["bob@gmail.com", "emma@gmail.com", "sarah@gmail.com", "alex@gmail.com"]
                          )

In [33]:
students_df

                FirstName  LastName  Age                   Major  Score
bob@gmail.com         Bob  Williams   26    Computer Engineering     86
emma@gmail.com       Emma   Johnson   23                    Math     92
sarah@gmail.com     Sarah     Smith   22               Chemistry     95
alex@gmail.com       Alex     Brown   21  Electrical engineering     82

In [34]:
# How to convert a dictionary to pandas Datafram

dict = {"First_Name":['Bob', 'Emma', 'Sarah', 'Alex'],
        "Last_Name":['William', 'Johnson', 'Smith', 'Brown'],
        "Age":[26, 23, 22, 21],
        "Major":['Computer Engineering', 'Math', 'Chemistry', 'Electrical Engineering'],
        "Score":[86, 92, 95, 82],       
       }

In [35]:
students_df2 = pd.DataFrame(dict)

In [36]:
students_df2

  First_Name Last_Name  Age                   Major  Score
0        Bob   William   26    Computer Engineering     86
1       Emma   Johnson   23                    Math     92
2      Sarah     Smith   22               Chemistry     95
3       Alex     Brown   21  Electrical Engineering     82

In [38]:
# Specifying certain columns only
students_df2 = pd.DataFrame(dict, columns = ["First_Name", "Score"])
students_df2

  First_Name  Score
0        Bob     86
1       Emma     92
2      Sarah     95
3       Alex     82

In [42]:
students_df2 = pd.DataFrame(dict, index = [0, 1, 2, 3])

In [43]:
# to view the index
students_df.index

Index(['bob@gmail.com', 'emma@gmail.com', 'sarah@gmail.com', 'alex@gmail.com'], dtype='object')

In [44]:
# to view the columns
students_df.columns

Index(['FirstName', 'LastName', 'Age', 'Major', 'Score'], dtype='object')

In [45]:
# to determine the number of rows and columns
students_df.shape

(4, 5)

In [46]:
# To display the first n values we use the head() method
students_df.head(2)

               FirstName  LastName  Age                 Major  Score
bob@gmail.com        Bob  Williams   26  Computer Engineering     86
emma@gmail.com      Emma   Johnson   23                  Math     92

In [47]:
# to display the last rows of the DataFrame
students_df.tail(2)

                FirstName LastName  Age                   Major  Score
sarah@gmail.com     Sarah    Smith   22               Chemistry     95
alex@gmail.com       Alex    Brown   21  Electrical engineering     82

In [49]:
# To Display the all columns with their datatypes and the number of all non-null values
# The memory usage too
students_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, bob@gmail.com to alex@gmail.com
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   FirstName  4 non-null      object
 1   LastName   4 non-null      object
 2   Age        4 non-null      int64
 3   Major      4 non-null      object
 4   Score      4 non-null      int64
dtypes: int64(2), object(3)
memory usage: 192.0+ bytes

In [50]:
# Used to display some basic statistical details like mean, standard deviation, 
# count the percetiles, min number and the maximum number
students_df.describe()

             Age     Score
count   4.000000   4.00000
mean   23.000000  88.75000
std     2.160247   5.85235
min    21.000000  82.00000
25%    21.750000  85.00000
50%    22.500000  89.00000
75%    23.750000  92.75000
max    26.000000  95.00000